{"meta":{"title":"Tecur","subtitle":"Welcome to my blog.","description":"Tecur's Blog","author":"Tecur","url":"https://blog.tecur.xyz","root":"/"},"pages":[{"title":"Rocket Engine Calculator","date":"2021-03-01T12:25:55.854Z","updated":"2021-03-01T12:25:55.854Z","comments":false,"path":"Projekte/RE_calc.html","permalink":"https://blog.tecur.xyz/Projekte/RE_calc.html","excerpt":"","text":"[![](https://img.shields.io/github/release/Tecur/rocket_engine_calc.svg)]()[![](https://img.shields.io/github/issues/Tecur/rocket_engine_calc.svg)]()[![](https://img.shields.io/github/license/Tecur/rocket_engine_calc.svg)]() # Projektbeschreibung Rocket Engine Calculator (kurz RE-Calc) ist ein kleines Programm zum berechnen einiger wichtiger Parameter eines Raketentriebwerkes. Das Programm entstand durch mein persönliches Interesse an Flüssigkeitstriebwerken und durch zu viel Freizeit in den Semesterferien. Repository Das Programm ist in Visual C# geschrieben und steht vollständig auf GitHub zur verfügung. Link zum GitHub Repository"},{"title":"Projekte","date":"2021-03-01T12:25:55.854Z","updated":"2021-03-01T12:25:55.854Z","comments":false,"path":"Projekte/index.html","permalink":"https://blog.tecur.xyz/Projekte/index.html","excerpt":"","text":"Rocket Engine Calculator [![](https://img.shields.io/github/release/Tecur/rocket_engine_calc.svg)]() Open Source Programm zum berechenen wichtiger Parameter von Raketentriebwerken. [mehr...](/Projekte/RE_calc.html)"},{"title":"tags","date":"2018-10-19T15:18:48.000Z","updated":"2021-03-01T12:25:55.861Z","comments":true,"path":"/tags/index.html","permalink":"https://blog.tecur.xyz/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2018-10-19T15:18:35.000Z","updated":"2021-03-01T12:25:55.860Z","comments":true,"path":"/categories/index.html","permalink":"https://blog.tecur.xyz/categories/index.html","excerpt":"","text":""},{"title":"Über mich","date":"2018-10-19T15:17:35.000Z","updated":"2021-03-01T12:25:55.859Z","comments":true,"path":"/about/index.html","permalink":"https://blog.tecur.xyz/about/index.html","excerpt":"","text":"Hallo ich bin Joshua."}],"posts":[{"title":"Building a Flatfield Mask","slug":"Building-a-Flatfieldmask","date":"2024-08-28T21:36:09.000Z","updated":"2024-09-07T18:20:14.203Z","comments":true,"path":"2024/08/28/Building-a-Flatfieldmask/","link":"","permalink":"https://blog.tecur.xyz/2024/08/28/Building-a-Flatfieldmask/","excerpt":"The use of bias, dark and flat frames to calibrate light frames is fundamental for astrophotography. While bias and dark frames can be created with relatively little effort, a more complicated setup is required to create flat frames. Flat frames require a mask that is as evenly illuminated as possible in order to be able to correct differences in brightness in the light frames. These flatfield masks can be purchased from specialist astronomy dealers for several hundred euros. For larger aperture diameters, the price can easily reach into the mid to high three-digit range. In my case, I would need a flatfield mask with a diameter of around 240 mm. These would cost around 500 € from specialist dealers. If you want to spend less money on a mask, you can also build one yourself. In this blog post, I would like to show you how I built the flatfield mask for my Bresser NT203/1000.","text":"The use of bias, dark and flat frames to calibrate light frames is fundamental for astrophotography. While bias and dark frames can be created with relatively little effort, a more complicated setup is required to create flat frames. Flat frames require a mask that is as evenly illuminated as possible in order to be able to correct differences in brightness in the light frames. These flatfield masks can be purchased from specialist astronomy dealers for several hundred euros. For larger aperture diameters, the price can easily reach into the mid to high three-digit range. In my case, I would need a flatfield mask with a diameter of around 240 mm. These would cost around 500 € from specialist dealers. If you want to spend less money on a mask, you can also build one yourself. In this blog post, I would like to show you how I built the flatfield mask for my Bresser NT203/1000. Parts list The following materials are required for the project: Component Notes Price Round acrylic sheet see one of the many acrylic cutting websites; should be as thick as the LED strip is wide 13.65 € LED strip sufficient length for one circumference of the acrylic glass panel; preferably cold light (6000 K); highest possible LED density 6.99 € Bidirectional filament adhesive tape 11.99 € Frosted glass film without textured surface 7.99 € White lacquer film or other white reflective surfaces 5.45 € Acrylic glass-compatible adhesive 9.99 € Black adhesive tape e.g. insulating adhesive tape 1.25 € Total 57.31 € A 3D printer is also required to produce the mounting. The costs I paid for the materials can be seen next to the individual components. It is possible to buy these components even cheaper with a little more research. Preparation of the light guide plate Instead of an LED matrix, which creates an evenly illuminated surface through a diffuser, a design with a light guide plate was chosen for this flatfield mask. The light guide plate is illuminated by the LED strip attached to the side and distributes the light over the entire surface. Professional light guide plates, which have an engraved surface to diffuse the light, can quickly become very expensive given the required surface area and thickness. These would then offer no budgetary advantage over a very large LED matrix. Instead, a simple acrylic glass panel should be used. The first step is to remove all protective film from the acrylic sheet. The bidirectional filament adhesive tape is then applied to one side, which will later become the light-emitting side. Care should be taken to ensure that the individual adhesive strips do not overlap and all run in the same direction. The protruding ends can be trimmed with a knife. During the entire process, care should be taken not to scratch the acrylic glass panel. In retrospect, it would have made more sense to apply the adhesive tape on both sides. In the next step, the white paint film is applied to the opposite side. If this is not self-adhesive, additional adhesive must be used here. The adhesive should be applied as evenly as possible. Air bubbles could not be avoided. In the end, several layers were used to block all light. The LED strip can then be glued on. First, however, the required length should be determined by placing the strip against the circumference of the circle. The LED segments that are not required can be cut off. The adhesive must then be applied to the side with the LED diodes. It is advisable to think beforehand about how the LED strip will be pressed against the edge of the panel during drying. Once drying is complete, a first attempt at lighting can be made. The light pattern inside the glass should already be as uniform as possible. The stray light escaping from the side can still be ignored. If the result is not satisfactory, it must be improved. This may be due to insufficient contact between the LED strip and the edge. In this case, new gluing must be carried out if possible. If the result is satisfactory, the edges of the panel, including the LED strips, can be covered with black adhesive tape. Care should be taken to ensure that as little illuminated area as possible is covered. My acrylic glass plate was ordered with enough spare area so that the black adhesive strips are not visible in the telescope’s field of view. I originally planned to tape the frosted glass film on the filament tape. However, the frosted film was not able to fully obscure the flament pattern. In the final design multiple circular cutouts of frosted film were used. The sheets were stacked and placed in the mounting backet and pressed down by the lighting setup. Manufacturing the mounting To make it as easy as possible to use, the illumination system should be inserted into the telescope tube in the same way as the cover supplied with the telescope. One problem here is the production. Since only a Prusa MINI+ with 180 mm x 180 mm x 180 mm build room is available, the entire mount cannot be printed as a single part. A precisely fitting mounting is also very difficult to realize. Numerous tolerances in the radial and axial direction result in significant tolerance stacks. These must be compensated for in the design. The final design provides for a mounting ring which is placed on the tube like the supplied cover. The illumination system, together with the light diffusion sheets is inserted into this ring. A lid is used to press the illumination system into the mounting ring. One of the mouning ring segments has a hole for the power cable. The setup is shown in the following image: The parts are printed using PETG and threaded inserts are used to join the parts together. Final thoughts The self-build flatfield mask creates an (almost) evenly illuminated surface. At least with the bare eye, no variation in brightness is visible. With a camera, a slight reduction of brightness towards the middle of the mask is visible. If this effect is still visible in the telescopes field of view is yet to be determined. There are multiple options to improve the light guiding plate design. The filament tape works fine on the light-emitting side of the light guide plate. Placeing another filament tape film on the other (reflective) side oth the light guide plate might improve the light scattering effect in the guide plate. The white adhesive film worked great. Greater care should be taken, when placeing the film, to not create air bubbles. The light diffusion system needs improvement. The forsted film worked good enough in the end. Maybe a professional light diffusion plate is a better option here. Another option is to use a translucent white acrylic plate instead of a fully transparent one. The LED strip with USB Type A connector works great. Same goes for the monting mechanism. Using a little bit of adhesive foam tape to compensate for tolerances also works great. Quite a bit of trial and error was needed to create this flatmask. A sign of this approach is the adhesive residue from previous tries on the acrylic glass. If this residue has any effect on the quality of the flatmask needs to be examined. As of writing this, a test run with the telescope is still pending.","categories":[],"tags":[{"name":"Astrophotography","slug":"Astrophotography","permalink":"https://blog.tecur.xyz/tags/Astrophotography/"},{"name":"Telescope","slug":"Telescope","permalink":"https://blog.tecur.xyz/tags/Telescope/"}]},{"title":"CASIO fx-9750GII Firmware Update","slug":"Casio-fx-9750GII-Update","date":"2018-02-02T23:00:00.000Z","updated":"2021-03-02T09:45:00.740Z","comments":true,"path":"2018/02/03/Casio-fx-9750GII-Update/","link":"","permalink":"https://blog.tecur.xyz/2018/02/03/Casio-fx-9750GII-Update/","excerpt":"Both CASIO fx-9750GII and CASIO fx-9860GII use the same SH4A CPU. Therefore the old firmware of the fx-9750GII (02.02.xxxx) can be replaced by the newer firmware of the fx-9860GII (02.02.0201). This allows users of the fx-9750GII to enjoy the new features, that come with the firmware update, such as MathView.","text":"Both CASIO fx-9750GII and CASIO fx-9860GII use the same SH4A CPU. Therefore the old firmware of the fx-9750GII (02.02.xxxx) can be replaced by the newer firmware of the fx-9860GII (02.02.0201). This allows users of the fx-9750GII to enjoy the new features, that come with the firmware update, such as MathView. 1. Preperation This article describes procedures to flash the CASIO fx-9750GII. All actions taken are at your own risk. I take no responsibility for any damaged hardware. 1.1 Supported Versions 02.02.xxxx You can find your current version under SYSTEM -&gt; F4 -&gt; Version OS 1.2 Required Software Flash Tool &amp; Firmware (Chinese Forum with an Account needed) CASIO Driver (CASIO FA-124 Software) 1.3 Backup Make shure, that the Calculator is set to “USB” in the LINK menu Connect Calculator to PC (FA-124 must already be installed) F1 “DataTrans” Open fxRemote.exe click “Backup Flash” and save the file If everything went right the console should read “Checksum OK” 2. Flash Turn off the Calculator (don’t disconnect!) Press the RESET-Button on the back of the Calculator with a pencil Press “F2”, “4” and “AC/ON” while still holding the RESET-Button Release the RESET-Button Keep the other Buttons pressed for 3-4 sec. and then release them Press “9” for 1 sec. Press “x” (Multiplication) for 1 sec. The screen should look like this: OS ERROR Please update OS. The Calculator is now in Flashmode. Open fxRemote.exe and click “Recover Flash” Select 2_02_0201_sh4.fls and wait Close the next two windows with “OK” Now the program should flash The Calculator restarts, as soon as the progress is finished. Dismiss all upcoming messages. Now following things should be diffrent: The OS Version should now be 02.02.0201 There are two new programs: “e-ACT” and “S-SHT” Under “Shift”+“SET UP” you can change the “Input/Output”-Setting You can now install 1,5 MB of Plug-Ins with FA-124 Should the Calculator crash after the first start, just press the RESET-Button","categories":[{"name":"Computer Science","slug":"Computer-Science","permalink":"https://blog.tecur.xyz/categories/Computer-Science/"}],"tags":[{"name":"Calculator","slug":"Calculator","permalink":"https://blog.tecur.xyz/tags/Calculator/"},{"name":"CASIO","slug":"CASIO","permalink":"https://blog.tecur.xyz/tags/CASIO/"},{"name":"Flash","slug":"Flash","permalink":"https://blog.tecur.xyz/tags/Flash/"},{"name":"Tutorial","slug":"Tutorial","permalink":"https://blog.tecur.xyz/tags/Tutorial/"}]}],"categories":[{"name":"Computer Science","slug":"Computer-Science","permalink":"https://blog.tecur.xyz/categories/Computer-Science/"}],"tags":[{"name":"Astrophotography","slug":"Astrophotography","permalink":"https://blog.tecur.xyz/tags/Astrophotography/"},{"name":"Telescope","slug":"Telescope","permalink":"https://blog.tecur.xyz/tags/Telescope/"},{"name":"Calculator","slug":"Calculator","permalink":"https://blog.tecur.xyz/tags/Calculator/"},{"name":"CASIO","slug":"CASIO","permalink":"https://blog.tecur.xyz/tags/CASIO/"},{"name":"Flash","slug":"Flash","permalink":"https://blog.tecur.xyz/tags/Flash/"},{"name":"Tutorial","slug":"Tutorial","permalink":"https://blog.tecur.xyz/tags/Tutorial/"}]}